export default {
    phone: { pattern: /^1(3|4|5|6|7|8|9)\d{9}$/, message: "手机号码有误，请重填" },
    otp: { pattern: /\d{6}/, message: "请输入6为数字验证码" },
    postCode: { pattern: /^[0-9]{6}$/, message: "邮编格式错误" },
    identityId: {
        pattern: /^(([1][1-5])|([2][1-3])|([3][1-7])|([4][1-6])|([5][0-4])|([6][1-5])|([7][1])|([8][1-2]))\d{4}(([1][9]\d{2})|([2]\d{3}))(([0][1-9])|([1][0-2]))(([0][1-9])|([1-2][0-9])|([3][0-1]))\d{3}[0-9xX]$/,
        message: "身份证格式有误，请重新填写"
    },
    url:{
        pattern:/^\w+[^\s]+(\.[^\s]+){1,}$/,
        message:"链接格式错误，请重新填写"
    }
}